import { Component, OnInit, Input } from '@angular/core';

@Component({
  selector: 'app-blog',
  templateUrl: './blog.component.html',
  styleUrls: ['./blog.component.scss']
})
export class BlogComponent implements OnInit {

  articles: any[] = [
    {
      image: "assets/img/Mask_3.png",
      title: "ایران گردی با موسم",
      date: "۲۵ خرداد ۱۳۹۸- نوشته آرش خرسند",
      description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      link: "blog"
    },
    {
      image: "assets/img/Mask.png",
      title: "متل قو و جاذبه های سلمانشهر",
      date: "۲۵ خرداد ۱۳۹۸- نوشته آرش خرسند",
      description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      link: "blog"
    },
    {
      image: "assets/img/Mask_4.png",
      title: "اصفهان گردی به سبک موسم",
      date: "۲۵ خرداد ۱۳۹۸- نوشته آرش خرسند",
      description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      link: "blog"
    },
    {
      image: "assets/img/Mask_2.png",
      title: "بازار تهران؛ از گلوبندک تا آب منگل",
      date: "۲۵ خرداد ۱۳۹۸- نوشته آرش خرسند",
      description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      link: "blog"
    },
    {
      image: "assets/img/Mask_3.png",
      title: "ایران گردی با موسم",
      date: "۲۵ خرداد ۱۳۹۸- نوشته آرش خرسند",
      description: "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد.",
      link: "blog"
    }
  ];
  
  constructor() { }

  ngOnInit() {
  }

}
